## Отчет по лабораторной работе № 2

#### № группы: `ПМ-2401`

#### Выполнил: `Безносова Варвара Владиславовна`

#### Вариант: `3`

### Cодержание:

- [Постановка задачи](#1-постановка-задачи)
- [Входные и выходные данные](#2-входные-и-выходные-данные)
- [Выбор структуры данных](#3-выбор-структуры-данных)
- [Алгоритм](#4-алгоритм)
- [Программа](#5-программа)
- [Анализ правильности решения](#6-анализ-правильности-решения)

### 1. Постановка задачи
>Напишите программу на Java, которая выполняет следующие действия
с двумерным массивом целых чисел:
>1. Считывает с консоли размеры массива N и M, затем элементы
массива размером N × M.
>2. Сортирует каждый столбец массива по возрастанию методом пузырька, затем сортирует по убыванию каждую строку методом вставок. Далее сортирует главную диагональ массива по возрастанию.
>3. Вычисляет среднее арифметическое всех нечётных элементов массива, а также количество таких элементов.
>4. Выводит элементы массива в зигзагообразном порядке, начиная с
верхнего левого элемента и двигаясь вправо, затем вниз по столбцу,
затем влево и так далее. Реализовать алгоритм с помощью одного
цикла.
>5. Заменяет все чётные числа в массиве на их отрицательные значения, а нечётные — на их квадраты, и выводит полученный массив.



### 2. Входные и выходные данные

#### Данные на вход

На вход программа должна получить 2 натуральных числа `N` и `M`, а также элементы массива в количестве N*M


#### Данные на выход

На выходе мы получим среднее арифметическое нечетных чисел, количество нечетных чисел, элементы массива в зигзагообразном порядке и в конце измененный массив, где все четные числа заменены на отрицательные, а нечетные на их квадраты

### 3. Выбор структуры данных

Программа получает 2 натуральных числа. Поэтому для их хранения
можно выделить 2 переменные `N` и `M` типа int.
Количество и среднее арифметическое нечетных чисел мы храним в переменных `k` типа int и `average` типа double
### 4. Алгоритм

#### Алгоритм выполнения программы:

1. **Ввод данных:**  
   Программа считывает 2 натуральных числа `N` и `M`, далее элементы массива в количестве `N*M`

2. **Сортировка чисел:**  
   Программа делает сортировку методом пузырька: последовательно сравнивает значения соседних элементов и меняет числа местами, если предыдущее оказывается больше последующего. Далее сортировку методом вставки: на каждом шаге алгоритма программа берет один из элементов массива, находит позицию для вставки и вставляет
3. **Операции над числами**
    Программа сортирует главную диагональ по возрастанию. Для этого все элементы на главной диагонали поместим в отдельный массив, отсортируем его и вставим отсортированные элементы в исходный массив
    Программа вычисляет среднее арифметическое, поделив сумму нечетных чисел на их количество
    Программа с помощью одного цикла выводит элементы массива в зигзагообразном порядке, начиная с верхнего левого элемента и двигаясь вправо, затем вниз по столбцу,затем влево и так далее

3. **Вывод результата:**
    На выходе мы получим среднее арифметическое нечетных чисел, количество нечетных чисел, элементы массива в зигзагообразном порядке и в конце измененный массив, где все четные числа заменены на отрицательные, а нечетные на их квадраты
  
### 5. Программа
```java
import java.util.Scanner;
public class Main{
    public static void main (String[] args){
        Scanner s = new Scanner(System.in);
        int M = s.nextInt();//количество столбцов
        int N = s.nextInt();//количество строк
        
        int[][] array = new int[N][M];

        for (int i = 0; i < N; i++) {
            for (int j = 0; j < M; j++) {
                array[i][j] = s.nextInt();
            }
        }
        for (int i = 0; i < N; i++) { // сортировка по столбцам методом пузырька
            for (int j = 0; j < M; j++) {
                for (int k = 0; k <  N- i - 1; k++) {
                    if (array[k][j] > array[k+1][j]) {
                        int t = array[k][j];
                        array[k][j] = array[k+1][j];
                        array[k+1][j] = t;
                    }
                }
            }
        }

        // cортировка каждой строки по убыванию методом вставок
        for (int i = 0; i < N; i++) {
            for (int j = 1; j<M; j++) {
                int key = array[i][j];
                int kr = j - 1;
                while (kr >= 0 && array[i][kr] < key) {
                    array[i][kr + 1] = array[i][kr];
                    kr--;
                }
                array[i][kr + 1] = key;
            }
        }
        int[] diagonal = new int[Math.min(M,N)]; // массив, где хранятся элементы главной диагонали
        for (int i = 0; i < Math.min(M,N); i++) {
            diagonal[i] = array[i][i];
        }
        for (int i = 0; i < Math.min(M,N) - 1; i++) {
            for (int j = 0; j < Math.min(M,N) - 1 - i; j++) {
                if (diagonal[j] < diagonal[j + 1]) {
                    int t = diagonal[j];
                    diagonal[j] = diagonal[j + 1];
                    diagonal[j + 1] = t;
                }
            }
        }
        for (int i = 0; i < Math.min(M,N); i++) {
            array[i][i] = diagonal[i];
        }
        int k = 0;// количество нечетных чисел
        int su = 0;//их сумма
        for (int i = 0; i < N; i++) {
            for (int j = 0; j < M; j++) {
                if (array[i][j] % 2 != 0) { 
                    su += array[i][j]; 
                    k++;
                }
            }
        }
        if (k > 0) {
            double average = su/k; // среднее арифметическое нечетных чисел
            System.out.println("среднее арифметическое нечётных элементов: " + average);
            System.out.println("количество нечётных элементов: " + k);
        } else {
            System.out.println("нет нечётных элементов в массиве");
        }
        for (int c = 0; c < M*N; c++) {
            int i = c / M; // индекс строки
            int j = c % M; // индекс столбца

            // если строка четная, выводим элементы слева направо
            if (i % 2 == 0) {
                System.out.print(array[i][j] + " ");
            } else { 
                System.out.print(array[i][M - 1 - j] + " ");
            }
        }
        for (int i = 0; i < N; i++) {
            for (int j = 0; j < M; j++) {
                System.out.print(array[i][j] + " ");
            }
            System.out.println();
        }
        for (int i = 0; i < N; i++) {
            for (int j = 0; j < M; j++) {
                if (array[i][j] % 2 == 0) {
                    array[i][j] = -array[i][j];
                } else {
                    array[i][j] = array[i][j] * array[i][j];
                }
            }
        }
        for (int i = 0; i < N; i++) {
            for (int j = 0; j < M; j++) {
                System.out.print(array[i][j] + " ");
            }
            System.out.println();
        }
    }
}
```
### 6. Анализ правильности решения

Программа работает корректно на всем множестве решений с учетом ограничений.

1. Тест на `N`=2,`M`=3, N*M: 5 6 7 1 2 3:

    - **Input**:
        ```
        3
        2
        5
        6
        7
        1
        2
        3
      
        ```

    - **Output**:
        ```
        среднее арифметическое нечётных эkементов: 4.0
        количество нечётных элементов: 4
        6 2 1 5 3 7 6 2 1
        7 3 5
        -6 -2 1
        49 9 25
        ```
2. Тест на `N`=2,`M`=3, N*M: 4 6 7 0 2 8: (без нечетных чисел)

    - **Input**:
        ```
        3
        2
        5
        6
        7
        1
        2
        3
      
        ```

    - **Output**:
        ```
        нет нечётных элементов в массиве
        6 2 1 5 3 7 6 2 1
        8 2 0 4 6 10 8 2 0
        10 6 4
        -8 -2 0
        -10 -6 -4
        ```



